const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "Obot",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "🔰𝐑𝐀𝐇𝐀𝐓 𝐈𝐒𝐋𝐀𝐌🔰",
  description: "goibot",
  commandCategory: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
};

module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Dhaka").format("HH:MM:ss L");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = [
    "إذا زادت بوت سأغادر 😒😒",
    "لن أسمع 😼 لم تحب رئيسي (راهات) 🥺 يا فاشل 🥺",
    "أنا لا أتحدث مع الأغبياء، حسناً 😒",
    "لا تناديني كثيراً، سأقع في الحب 🙈",
    "قل لي يا حبيبي، هل تحبني؟ 🙈💋",
    "إذا ناديت كثيراً سأغضب 😑",
    "نعم قل 😒، ماذا يمكنني أن أفعل من أجلك 😐😑؟",
    "لماذا تنادي كثيراً؟ هل تريد الشتائم؟ 🤬",
    "أحبك يا جانو 🥰",
    "أهلاً قل لي كيف حالك 😚",
    "أنت لا تحترمني 😰😿",
    "توقف 😾 قل رئيس 😼",
    "اصمت وإلا سأكسر أسنانك",
    "إذا قلت بوت مرة أخرى سأقصه وأجعله صغيراً 🤭🤫",
    "لماذا يغادر البوت هكذا 😤🥺 ماذا حدث؟",
    "قل يا جانو 😘",
    "تزعجني كثيراً 😾، أنا مشغول مع جانو 😋",
    "يا أحمق لماذا تنادي كثيراً 🤬",
    "إذا ناديتني، سأعطيك قبلة 😘",
    "لا تناديني كثيراً، ليس لدي مزاج للمرح 😒",
    "أنا هنا مخفي، لا تزعجني 🙊🙁",
    "نعم يا جانو، تعال من هنا سأعطيك قبلة 🤭 😘",
    "ابتعد، ليس لديك عمل، فقط تدير بوت بوت 😉😋🤣",
    "لا أحد في بيتك يسمع كلامك، فهل سأسمع أنا؟ 🤔😂",
    "لا تناديني، أنا مشغول",
    "ماذا حدث؟ هل ارتكبت خطأً؟ 🤣",
    "قل ماذا ستقول، هل ستقوله أمام الجميع؟ 🤭🤏",
    "هل سنلتقي غداً؟ 😈",
    "نعم قل، أنا أستمع 😏",
    "كم مرة ستنادي؟ أنا أستمع",
    "همم قل ماذا ستفعل 😒",
    "حتى أثناء اللعب تناديني 😑🌚🔞",
    "قل ماذا يمكنني أن أفعل من أجلك",
    "أنا لا أرى أي شيء 👀 😎",
    "رئيس راهات يحبك 😌",
    "قل يا جانو 🌚",
    "ألا ترى أنني مشغول مع جانو 😒",
    "همم جانو، هناك مشكلة 😑😘",
    "أهلاً اسمع، جانو في كل مكان 😇😘",
    "ماذا ستفعل؟ 😒😬",
    "السلام عليكم، قل ماذا يمكنني أن أفعل من أجلك..! 🥰",
    "لا تناديني كثيراً، أعطه لصديقته 🙄",
    "لماذا تناديني كثيراً؟ 🤔 هل تحب أم لا؟ 🤭🙈",
    "🌻🌺💚 السلام عليكم ورحمة الله 💚🌺🌻",
    "أنا مشغول الآن مع رئيس راهات، لا تناديني 😕😏 شكرًا 🤝🌻",
    "لا تناديني، أعطه لصديقته 😽🫶🌺",
    "جانو 🥺 الآن قل للبوت فقط 😒 نسيت؟ 🙂❓",
    "أفف لم أفهم لماذا تنادي هكذا 😤😡😈"
  ];

  var rand = tl[Math.floor(Math.random() * tl.length)];

  // أمثلة على الأوامر
  if ((event.body.toLowerCase() == "MISS YOU") || (event.body.toLowerCase() == "miss you")) {
    return api.sendMessage("<أفتقدك الليلة 🥹🤖👅/👅-✘ 🎀 🍒:))", threadID);
  };

  if (event.body.indexOf("/بوت") == 0) {
    var msg = {
      body: `${name}, ${rand}`
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
